public class HomeWork2 {
    public static void main(String[] args) {

    }
    /*First level: В сборной по футболу есть 20 игроков,
    у каждого игрока есть свой номер. В массиве номера упорядочены и
    отсортированы в порядке возрастания.
    С помощью бинарного поиска(двоичного поиска) ,
    найдите 3 игроков: игрока, который в массиве находится по середине,
     игрока, который находится левее, чем игрок посередине и любого игрока,
     который находится правее, чем игрок посередине.
     */

/*
    Можно написать на Java или JavaScript.


    Second level: Ознакомьтесь с задачей коммивояжёра:


    https://thecode.media/komm/
     */

}
